# More Data Preprocessing (with Pandas)

Pandas is a very useful data analytics package within Python.

Let's start with some random data.

In [51]:
import pandas as pd
import numpy as np

In [52]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df

        one       two     three
a -0.945571 -0.080999 -0.993920
c  0.198835  0.652245 -1.650766
e -0.643246  0.736422  0.573722
f  1.527944 -1.389363 -0.816011
h  0.940898 -0.305279 -0.808381

We know with Pandas we can mix & match data types, so let us add two more columns, named 'four' and 'five':

In [53]:
df['four'] = 'bar'
df['five'] = df['one'] > 0
df

        one       two     three four   five
a -0.945571 -0.080999 -0.993920  bar  False
c  0.198835  0.652245 -1.650766  bar   True
e -0.643246  0.736422  0.573722  bar  False
f  1.527944 -1.389363 -0.816011  bar   True
h  0.940898 -0.305279 -0.808381  bar   True

Adding new rows is also simple. Below we include three extra empty rows:

In [54]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df2

        one       two     three four   five
a -0.945571 -0.080999 -0.993920  bar  False
b       NaN       NaN       NaN  NaN    NaN
c  0.198835  0.652245 -1.650766  bar   True
d       NaN       NaN       NaN  NaN    NaN
e -0.643246  0.736422  0.573722  bar  False
f  1.527944 -1.389363 -0.816011  bar   True
g       NaN       NaN       NaN  NaN    NaN
h  0.940898 -0.305279 -0.808381  bar   True

# Your Turn Here

Do you still remember how to index a row/column?

In [55]:
#### index row 'c' below
df2.loc['c']

one      0.198835
two      0.652245
three    -1.65077
four          bar
five         True
Name: c, dtype: object

In [56]:
#### index column 'two' below
df2.loc[:,'two']

a   -0.080999
b         NaN
c    0.652245
d         NaN
e    0.736422
f   -1.389363
g         NaN
h   -0.305279
Name: two, dtype: float64

pandas has two functions isnull() and notnull() that return boolean objects when called.

In [57]:
pd.isnull(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [58]:
pd.notnull(df2['one'])

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

Missing values propagate naturally through arithmetic operations between pandas objects.

In [59]:
a = df[['one','two']]
a['one']['a':'e'] = float('nan')
a

        one       two
a       NaN -0.080999
c       NaN  0.652245
e       NaN  0.736422
f  1.527944 -1.389363
h  0.940898 -0.305279

In [60]:
b = df[['one','two','three']]
b

        one       two     three
a -0.945571 -0.080999 -0.993920
c  0.198835  0.652245 -1.650766
e -0.643246  0.736422  0.573722
f  1.527944 -1.389363 -0.816011
h  0.940898 -0.305279 -0.808381

In [61]:
a + b

        one  three       two
a       NaN    NaN -0.161998
c       NaN    NaN  1.304490
e       NaN    NaN  1.472845
f  3.055887    NaN -2.778727
h  1.881796    NaN -0.610557

# How to deal with Missing Values

## Deleting Missing Values

The simplest method is always dropping all missing values - but it is highly **discouraged!!!**

In [62]:
a['one'].dropna()

f    1.527944
h    0.940898
Name: one, dtype: float64

By default, dropna() will drop any row containing **NaN** values, but you can change that by using the *axis=* and *thresh=* arguments.

**NOTE**: Dropping rows or columns have different uses.

In [63]:
#### This statement drop any column with NaN values
a.dropna(axis=1)

        two
a -0.080999
c  0.652245
e  0.736422
f -1.389363
h -0.305279

In [64]:
#### thresh determines how many non-NaN values a column/row should have without being dropped
c = a + b
c.dropna(axis=1, thresh=2)

        one       two
a       NaN -0.161998
c       NaN  1.304490
e       NaN  1.472845
f  3.055887 -2.778727
h  1.881796 -0.610557

You can also use the *how=* argument to determine how do you want to remove the NaN values.

In [65]:
#### By default, dropna() drops column/row with any NaN values
#### how = 'all' changes that to dropping column/row with all NaN values
c.dropna(axis=1, how='all')

        one       two
a       NaN -0.161998
c       NaN  1.304490
e       NaN  1.472845
f  3.055887 -2.778727
h  1.881796 -0.610557

You can refer to the [pandas.dropna() docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html) for more information.

## Imputing Missing Values

Imputing means filling missing values - you can do that when the missing and non-missing values are in some type of relationship.

In [66]:
my_series = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
my_series

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [67]:
#### you can fill missing values with a specific value (0)
my_series.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

Alternatively, we can specify a forward-fill to propagate the previous value forward:

In [68]:
# forward-fill
my_series.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [69]:
my_series.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

## Your Turn Here
Aforementioned method can be applied to dataframes.

In [70]:
#### Let us generate a random dataframe
rand_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['one', 'two', 'three'])
rand_df = rand_df.mask(np.random.random(rand_df.shape) < .3)
rand_df

        one       two     three
a -0.356323 -0.732055  1.141402
b  0.751413       NaN  1.652397
c -1.277424  0.124697 -1.275109
d       NaN -0.090116       NaN
e  0.773053  0.823175  0.197082

Your tasks are as follows:

- fill missing values in column **one** with value 1;
- fill missing values in column **two** with forward-filling;
- fill missing values in column **three** with backward-filling.

In [72]:
#### insert your code here
rand_df.loc[:,'one'] = rand_df.loc[:,'one'].fillna(1)
rand_df.loc[:,'two'] = rand_df.loc[:,'two'].fillna(method='ffill')
rand_df.loc[:,'three'] = rand_df.loc[:,'three'].fillna(method='bfill')
rand_df

        one       two     three
a -0.356323 -0.732055  1.141402
b  0.751413 -0.732055  1.652397
c -1.277424  0.124697 -1.275109
d  1.000000 -0.090116  0.197082
e  0.773053  0.823175  0.197082

A useful approach for imputing your missing data is to use mean/mode to replace missing data - the reason behind this logic is that if we are going to *guess* the values of the missing data, the highest chance would be guessing it to be the mean/mode if the data follows **normal** distribution.

In [73]:
#### let us generate another DF
my_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['A', 'B', 'C'])
my_df = my_df.mask(np.random.random(my_df.shape) < .3)
my_df

          A         B         C
a -0.430975 -0.423327       NaN
b  1.495985       NaN  0.303451
c       NaN -0.941246  0.659688
d  0.349092 -1.508244       NaN
e       NaN -0.830538  1.451241

In [74]:
#### Let us check if there is any missing value in the df
my_df.isnull().values.any()

True

In [75]:
#### Then we are getting the mean of the DF
#### Note that since we only 
my_df.mean()

A    0.471368
B   -0.925839
C    0.804793
dtype: float64

In [76]:
df_filled = my_df.fillna(my_df.mean())
df_filled

          A         B         C
a -0.430975 -0.423327  0.804793
b  1.495985 -0.925839  0.303451
c  0.471368 -0.941246  0.659688
d  0.349092 -1.508244  0.804793
e  0.471368 -0.830538  1.451241

In [77]:
#### Now let us check again if there is any missing values
df_filled.isnull().values.any()

False

More info regarding how to handle missing data can be found [here](https://machinelearningmastery.com/handle-missing-data-python/).

# Other Tasks in Data Preprocessing

- Handling categorical data (coding)
- Handling imbalanced data
- feature engineering

These topics will be covered in later part of this class.

In [ ]:
Brian Nicholls